In [1]:
from data import *

# apiData=API('2330')
table=BasicTable('2330')

start get data TaiwanStockMonthRevenue
start get data TaiwanStockPrice
start get data TaiwanStockFinancialStatements
start get data TaiwanStockDividend
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockMonthRevenue
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockPrice
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockDividend
get single data:  2330 2015-01-01 2023-02-08 TaiwanStockFinancialStatements

In [2]:
table.revenueTable

          date stock_id country       revenue  revenue_month  revenue_year
0   2015-01-01     2330  Taiwan   69510190000             12          2014
1   2015-02-01     2330  Taiwan   87120068000              1          2015
2   2015-03-01     2330  Taiwan   62645075000              2          2015
3   2015-04-01     2330  Taiwan   72269001000              3          2015
4   2015-05-01     2330  Taiwan   75329510000              4          2015
..         ...      ...     ...           ...            ...           ...
92  2022-09-01     2330  Taiwan  218132391000              8          2022
93  2022-10-01     2330  Taiwan  208247663000              9          2022
94  2022-11-01     2330  Taiwan  210265633000             10          2022
95  2022-12-01     2330  Taiwan  222705993000             11          2022
96  2023-01-01     2330  Taiwan  192560242000             12          2022

[97 rows x 6 columns]

In [9]:
pivotTable=md.bt.getPiovotTable(table.revenueTable,'revenue')

In [10]:
pivotTable

stock_id            2330
date
2015-01-01   69510190000
2015-02-01   87120068000
2015-03-01   62645075000
2015-04-01   72269001000
2015-05-01   75329510000
...                  ...
2022-09-01  218132391000
2022-10-01  208247663000
2022-11-01  210265633000
2022-12-01  222705993000
2023-01-01  192560242000

[97 rows x 1 columns]

In [13]:
YoY=md.bt.periodIncrease(12,pivotTable)

In [32]:
YoY

stock_id    2330
date
2015-01-01   NaN
2015-02-01   NaN
2015-03-01   NaN
2015-04-01   NaN
2015-05-01   NaN
...          ...
2022-09-01  59.0
2022-10-01  36.0
2022-11-01  56.0
2022-12-01  50.0
2023-01-01  24.0

[97 rows x 1 columns]

In [33]:
YoY.rename(columns={'2330':'YoY%'},inplace=True)

In [34]:
YoY

stock_id    YoY%
date
2015-01-01   NaN
2015-02-01   NaN
2015-03-01   NaN
2015-04-01   NaN
2015-05-01   NaN
...          ...
2022-09-01  59.0
2022-10-01  36.0
2022-11-01  56.0
2022-12-01  50.0
2023-01-01  24.0

[97 rows x 1 columns]

In [15]:
seasonYoY=md.bt.periodIncrease(12,pivotTable,3)

In [36]:
seasonYoY.rename(columns={'2330':'seasonYoY%'},inplace=True)

In [37]:
seasonYoY

stock_id    seasonYoY%
date
2015-01-01         NaN
2015-02-01         NaN
2015-03-01         NaN
2015-04-01         NaN
2015-05-01         NaN
...                ...
2022-09-01        41.0
2022-10-01        48.0
2022-11-01        50.0
2022-12-01        47.0
2023-01-01        43.0

[97 rows x 1 columns]

In [38]:
YoY.join(seasonYoY)

stock_id    YoY%  seasonYoY%
date
2015-01-01   NaN         NaN
2015-02-01   NaN         NaN
2015-03-01   NaN         NaN
2015-04-01   NaN         NaN
2015-05-01   NaN         NaN
...          ...         ...
2022-09-01  59.0        41.0
2022-10-01  36.0        48.0
2022-11-01  56.0        50.0
2022-12-01  50.0        47.0
2023-01-01  24.0        43.0

[97 rows x 2 columns]

In [26]:
dataframe=pd.merge(YoY,seasonYoY,left_index=True,right_index=True)

In [28]:
datarframe=pd.merge(dataframe,YoY,left_index=True,right_index=True)

In [29]:
datarframe

stock_id    2330_x  2330_y  2330
date
2015-01-01     NaN     NaN   NaN
2015-02-01     NaN     NaN   NaN
2015-03-01     NaN     NaN   NaN
2015-04-01     NaN     NaN   NaN
2015-05-01     NaN     NaN   NaN
...            ...     ...   ...
2022-09-01    59.0    41.0  59.0
2022-10-01    36.0    48.0  36.0
2022-11-01    56.0    50.0  56.0
2022-12-01    50.0    47.0  50.0
2023-01-01    24.0    43.0  24.0

[97 rows x 3 columns]

In [30]:
YoY.join(seasonYoY)

ValueError: columns overlap but no suffix specified: Index(['2330'], dtype='object', name='stock_id')